[Exclure les lignes différentes par formule Python](https://www.youtube.com/watch?v=u31xzznINxg&list=PLpQBnWleLAauKmgcdndmEr81iIIoW9_Wi&index=16)

Date : 20/05/2025

In [1]:
import pandas as pd

In [2]:
tab1 = pd.read_excel('data/Join.xlsx', sheet_name='Feuil1')

In [4]:
tab1.head()

             Nom    Prénom
0        Bonbeur      Jean
1        Hèresse    Mégane
2           Noix  Stéphane
3         Gature    Emilie
4  De MontéCarlo   Coralie

In [3]:
tab2 = pd.read_excel('data/Join.xlsx', sheet_name='Feuil2')

In [5]:
tab2.head()

             Nom    Prénom
0        Bonbeur      Jean
1        Hèresse    Mégane
2           Noix  Stéphane
3         Gature    Emilie
4  De MontéCarlo   Coralie

In [6]:
# Définition de l'index direct de chaque DF
tab1.set_index('Nom', inplace=True)
tab2.set_index('Nom', inplace=True)

In [9]:
# Recoupement entre les deux DF
tab1.join(tab2, lsuffix='_tab1', rsuffix='_tab2', sort=True
          ).dropna().drop(columns=['Prénom_tab2'])

              Prénom_tab1
Nom
Bonbeur              Jean
Braltar             Giles
De MontéCarlo     Coralie
Doeuf                John
Douche               Raël
Gature             Emilie
Hèresse            Mégane
Hénéré             Nadège
Jet                Claire
Lile              Maurice
Niomme             Gérard
Noix             Stéphane
Sarbaque             Anne
Solo                Yohan